heat-sim-H/0.orig/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
1136
(
(0.020198 0.00244859 0.00240155)
(0.0251867 0.00229466 0.00247605)
(0.0301601 0.0021956 0.00243931)
(0.0352059 0.00216743 0.0024349)
(0.040234 0.00215703 0.00243469)
(0.0452451 0.00215237 0.00243469)
(0.0502492 0.00215012 0.00243467)
(0.0552505 0.00214909 0.00243464)
...
)
;

boundaryField
{
    patch_1_0
    {
        type            calculated;
        value           nonuniform List<vector> 
184
(
(0.177751 0.00273407 0.00246971)
(0.177751 0.00774535 0.00252876)
(0.177751 0.0125102 0.00250569)
(0.177751 0.0175 0.00250242)
(0.177751 0.0224898 0.00250569)
(0.177751 0.0272546 0.00252877)
(0.177751 0.0322659 0.00246971)
(0.177751 0.0677341 0.00246971)
...
)
;
    }
    patch_2_0
    {
        type            calculated;
        value           nonuniform List<vector> 
568
(
(0.0203553 0.00260564 0)
(0.0253558 0.00246775 0)
(0.0301807 0.00236617 0)
(0.0352082 0.00233399 0)
(0.0402346 0.00232181 0)
(0.0452454 0.00231648 0)
(0.0502493 0.00231402 0)
(0.0552505 0.00231294 0)
...
)
;
    }
    patch_3_0
    {
        type            calculated;
        value           nonuniform List<vector> 
568
(
(0.0203553 0.00260564 0.01)
(0.0253558 0.00246775 0.01)
(0.0301807 0.00236617 0.01)
(0.0352082 0.00233399 0.01)
(0.0402346 0.00232181 0.01)
(0.0452454 0.00231648 0.01)
(0.0502493 0.00231402 0.01)
(0.0552505 0.00231294 0.01)
...
)
;
    }
    patch_4_0
    {
        type            calculated;
        value           nonuniform List<vector> 
36
(
(0.150243 0.035 0.00249683)
(0.155243 0.035 0.00250319)
(0.160254 0.035 0.00250108)
(0.165241 0.035 0.00250606)
(0.170005 0.035 0.00252807)
(0.175016 0.035 0.00247007)
(0.147751 0.0374937 0.00249751)
(0.147751 0.0424931 0.0025023)
...
)
;
    }
    patch_5_0
    {
        type            calculated;
        value           nonuniform List<vector> 
36
(
(0.0204861 0.035 0.00247006)
(0.0254966 0.035 0.00252807)
(0.0302605 0.035 0.00250606)
(0.0352472 0.035 0.00250098)
(0.0402566 0.035 0.00250253)
(0.0452569 0.035 0.00249761)
(0.0204861 0.035 0.00752994)
(0.0254966 0.035 0.00747193)
...
)
;
    }
}


// ************************************************************************* //
