heat-sim-H/0.orig/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1136
(
0.020198
0.0251867
0.0301601
0.0352059
0.040234
0.0452451
0.0502492
0.0552505
...
)
;

boundaryField
{
    patch_1_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
184
(
0.177751
0.177751
0.177751
0.177751
0.177751
0.177751
0.177751
0.177751
...
)
;
    }
    patch_2_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
568
(
0.0203553
0.0253558
0.0301807
0.0352082
0.0402346
0.0452454
0.0502493
0.0552505
...
)
;
    }
    patch_3_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
568
(
0.0203553
0.0253558
0.0301807
0.0352082
0.0402346
0.0452454
0.0502493
0.0552505
...
)
;
    }
    patch_4_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
36
(
0.150243
0.155243
0.160254
0.165241
0.170005
0.175016
0.147751
0.147751
...
)
;
    }
    patch_5_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
36
(
0.0204861
0.0254966
0.0302605
0.0352472
0.0402566
0.0452569
0.0204861
0.0254966
...
)
;
    }
}


// ************************************************************************* //
