heat-sim-H/0.orig/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1136
(
0.00244859
0.00229466
0.0021956
0.00216743
0.00215703
0.00215237
0.00215012
0.00214909
...
)
;

boundaryField
{
    patch_1_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
184
(
0.00273407
0.00774535
0.0125102
0.0175
0.0224898
0.0272546
0.0322659
0.0677341
...
)
;
    }
    patch_2_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
568
(
0.00260564
0.00246775
0.00236617
0.00233399
0.00232181
0.00231648
0.00231402
0.00231294
...
)
;
    }
    patch_3_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
568
(
0.00260564
0.00246775
0.00236617
0.00233399
0.00232181
0.00231648
0.00231402
0.00231294
...
)
;
    }
    patch_4_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
36
(
0.035
0.035
0.035
0.035
0.035
0.035
0.0374937
0.0424931
...
)
;
    }
    patch_5_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
36
(
0.035
0.035
0.035
0.035
0.035
0.035
0.035
0.035
...
)
;
    }
}


// ************************************************************************* //
