heat-sim-H/0.orig/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1136
(
0.00240155
0.00247605
0.00243931
0.0024349
0.00243469
0.00243469
0.00243467
0.00243464
...
)
;

boundaryField
{
    patch_1_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
184
(
0.00246971
0.00252876
0.00250569
0.00250242
0.00250569
0.00252877
0.00246971
0.00246971
...
)
;
    }
    patch_2_0
    {
        type            calculated;
        value           uniform 0;
    }
    patch_3_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
568
(
0.01
0.01
0.01
0.01
0.01
0.01
0.01
0.01
...
)
;
    }
    patch_4_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
36
(
0.00249683
0.00250319
0.00250108
0.00250606
0.00252807
0.00247007
0.00249751
0.0025023
...
)
;
    }
    patch_5_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
36
(
0.00247006
0.00252807
0.00250606
0.00250098
0.00250253
0.00249761
0.00752994
0.00747193
...
)
;
    }
}


// ************************************************************************* //
