heat-sim-H/0.orig/F
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM                                       |
|  \\    /   O peration     | Version:  v2312                               |
|   \\  /    A nd           | Website:  www.openfoam.com                    |
|    \\/     M anipulation  |                                               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      F;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0]; // TODO I just made it into acceleration, maybe should be fixed later

internalField   nonuniform List<vector>
1136                                   // Number of cells
(
        (-2.198782676975025 -1.3002534397182686 0.01296507230892333)
        (-2.166987980117312 -1.3882937584411632 -0.02052685646139091)
        (-2.1876233818344737 -1.514725071872304 -0.017997004123234454)
        (-2.23845840118114 -1.653265807683804 -0.011346462781404375)
        (-2.262765338825171 -1.7994223161715874 0.003407120873951979)
        (-2.273748415792942 -2.009886261998096 0.0010351645108518564)
        (-2.3961874724023127 -2.3219489263214372 -0.0902421120491825)
        (-2.83632838931582 -2.9292730308085724 -0.16827752273633367)
        (-3.591375790791978 -3.6825215093184824 0.09567301358746239)
        (-3.751056628004733 -3.489564238505212 2.02680585326894)
        (-4.377721648277784 -3.5118207019512004 4.038585321996387)
        (-4.573877728943437 -2.7662762934138763 3.749594816072203)
        (-5.603866924039421 -2.4047733251054204 2.651022060871581)
        (-6.6568074499489365 -1.9377438868895593 2.1684289504101932)
        (-6.621784369724403 -1.1801180675775509 2.728353608174804)
        (-5.729314906210146 -0.4789937338652078 2.178806871288557)
        (-5.277283500281753 0.01156452119030153 -0.07182421031409292)
        (-5.830123124308521 0.5302129258316872 -2.282934800110776)
        (-6.688619740556858 1.2412903205053105 -2.7031392603211195)
        (-6.569738352037708 1.972516804708385 -2.1720010881493614)
        (-5.52913796327327 2.4436254080801856 -2.740097406691425)
        (-4.614181356300804 2.835569384543729 -3.841117841653898)
        (-4.189243863656164 3.3648529990460743 -3.624883830397597)
        (-4.066865269198086 3.855351692912036 -1.7492981484163632)
        (-3.3920833619780426 3.476500354745764 -0.24054038994283325)
        (-2.7962210734546398 2.8801612414345694 0.2023791760995308)
        (-2.3761736912740044 2.2948611424528362 0.06658542793475902)
        (-2.2804897255517846 1.982653218811766 -0.0005395970976221783)
        (-2.260862625126024 1.7968266607759147 0.003021663385273569)
        (-2.2379845329335684 1.652255293622221 0.003414885266828864)
        (-2.215028149484591 1.5170303692919205 0.0044462874398947545)
        (-2.1666106251893464 1.388069480706249 0.011566196245384441)
        (-2.1344777435105624 -1.1617303932042526 -0.0285961936791096)
        (-2.205344417237911 -1.2512738444943343 0.0034332807100576675)
        (-2.2077342104806386 -1.3364300440316668 0.01158047370806179)
        (-2.16881290745578 -1.4587728136835763 -0.0021494881902329)
        (-2.229849395327504 -1.6159361527378695 -0.0035273873287706304)
        (-2.291576520385347 -1.8908998116881488 0.02089889630929786)
        (-2.73490946407414 -2.5515850586467415 -0.1828235451607425)
        (-3.503459890862511 -3.4866841905901973 -0.2890240580602054)
        (-5.303868613646936 -5.228730084209104 0.5647952294699088)
        (-6.256446608099715 -5.717156740574209 3.8206096150055084)
        (-5.211916461565623 -4.1045609178129485 6.727872329760959)
        (-5.205781029511009 -3.272985910323145 6.087425954251261)
        (-7.833949515387947 -3.710244890376815 3.1238799314675143)
        (-11.25433717187852 -3.7816339008600015 2.949470340728749)
        (-11.008766672340306 -2.3461750089247078 5.256630705256647)
        (-7.433572622764409 -0.7465971854007946 4.427120483107063)
        (-6.12218748096323 0.04607548865643886 -0.7565944315667117)
        (-8.499641824080822 0.9838196591069499 -5.19939508727601)
        (-11.535619418493393 2.6440398492240478 -4.6384274362586755)
        (-10.368570419293425 3.665006450492743 -2.5399816398330968)
        (-6.745512950880664 3.320494313785063 -3.8557786629609976)
        (-4.998501369129029 3.223398902978398 -6.551095895560743)
        (-5.68517214673423 4.441713921923164 -6.380771609526914)
        (-6.232995657487493 5.7628072608013365 -3.243445711924167)
        (-5.0176737307967185 4.950704962024101 -0.1759205143512546)
        (-3.476304265719385 3.448932827589543 0.309544863868426)
        (-2.6509248863958352 2.4663670346069577 0.0973210988425138)
        (-2.2954654719343273 1.8692354589861044 -0.015142149589373308)
        (-2.1950016320573047 1.5880225325623045 0.008285853248986237)
        (-2.215710373695944 1.450857352334768 -0.002083244672084431)
        (-2.2050437557511744 1.3344670222236636 -0.0016970887703074708)
        (-2.1441531528184115 1.2164351527353645 0.010220355821652484)
        (-1.9560377573594503 -0.8959487338369236 0.022779460440528705)
        (-2.1178259685086216 -1.0588050132306357 0.010167642594512732)
        (-2.169807693587944 -1.169715476418033 -0.02210112539339095)
        (-2.1822813380699317 -1.2777307723888423 -0.012224854894483272)
        (-2.196403440830461 -1.4680324161304281 0.036581327738756976)
        (-2.297255835546223 -1.9310603266305426 0.17254304313138555)
        (-2.8163231201423318 -2.722365547915369 0.2866567255407643)
        (-4.27015342319741 -4.399277446002851 0.5596805730136385)
        (-6.3692755982273805 -6.521548549482537 2.165119655110128)
        (-7.848713340037776 -7.437838539990011 7.6011192483447125)
        (-5.169233328929126 -4.295917612267998 11.699012514152235)
        (-4.2822490484907405 -2.853385717300699 11.164142912546506)
        (-7.563232010605773 -4.079136077043761 7.132824625723155)
        (-13.64147591358396 -5.388011125905876 6.223892048105496)
        (-14.676810432507644 -3.7558766893792646 8.941478466172839)
        (-8.278284484728854 -1.0053435391523617 8.173889012397474)
        (-4.583128000790583 0.04903077341797601 -0.21797828696864086)
        (-8.39114755661926 1.2003589977202767 -8.553878401173913)
        (-14.726527820052212 4.093916583124935 -9.137974900537527)
        (-13.721724194635478 5.735228538329995 -6.504008994558334)
        (-7.157281375466877 4.0441709019686325 -6.940170700195232)
        (-4.22647298721539 3.018109457617644 -10.498102221827533)
        (-5.533045437867343 4.639379442373546 -11.362812312183998)
        (-7.706131012460301 7.351358111837972 -6.525575734409045)
        (-6.415501793097677 6.572900523300408 -2.2710215918510217)
        (-3.7982211751627015 3.9429129959363856 -0.5586151223949023)
        (-2.770105307302103 2.673455711730443 -0.3819779502445239)
        (-2.275204457768515 1.880118344182201 -0.18355218646060445)
        (-2.157173813276811 1.3794692573834202 -0.00010043223695977224)
        (-2.2399319910073308 1.2883676581728034 -0.0026498922099408052)
        (-2.170123348433809 1.169198029337457 0.010643128943416798)
        (-2.0937297898783456 1.0460065383613468 0.008980977064271645)
        (-1.3938549036965573 -0.5853542223814345 -0.037608991963799715)
        (-1.6085881966833282 -0.6639487148501982 0.025337406529691124)
        (-2.026622008673917 -0.9388125731354 0.014552280385585648)
...
);

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }
// WALLS
    fixedWalls {
        type zeroGradient;
    }
    frontAndBack {
        type empty;
    }

    coldEnd {
        type zeroGradient;
    }

    hotEnd {
        type zeroGradient;
    }
        // WALLS
    patch_0_0 {
        type zeroGradient;
    }
    patch_1_0 {
        type zeroGradient;
    }

    // INLET
    patch_2_0 {
        type zeroGradient;
    }

    // OUTLET
    patch_3_0 {
        type zeroGradient;
    }

    // HEATER
    patch_4_0 {
        type zeroGradient;

    }

    // COOLER {
    patch_5_0 {
        type zeroGradient;
    }
}

// ************************************************************************* //
