heat-sim-H/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    // WALLS
    patch_0_0 {
        type noSlip;
    }
    patch_1_0 {
        type noSlip;
    }

    // INLET
    patch_2_0 {
        type noSlip;
    }

    // OUTLET
    patch_3_0 {
        type noSlip;
    }

    // HEATER
    patch_4_0 {
        type noSlip;
    }

    // COOLER {
    patch_5_0 {
        type noSlip;
    }
}


// ************************************************************************* //
