heat-sim-H/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // WALLS
    patch_0_0 {
        type zeroGradient;
    }
    patch_1_0 {
        type zeroGradient;
    }

    // INLET
    patch_2_0 {
        type zeroGradient;
    }

    // OUTLET
    patch_3_0 {
        type fixedValue;
        value uniform 0;
    }

    // HEATER
    patch_4_0 {
        type zeroGradient;

    }

    // COOLER {
    patch_5_0 {
        type zeroGradient;
    }
}


// ************************************************************************* //
