heat-sim-H/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

xMin    -0.007249091815114902;
xMax    0.20275090818488511;
yMin    -0.025;
yMax    0.125;
zMin    -0.025;
zMax    0.035;
cellsX  42;
cellsY  30;
cellsZ  12;

vertices
(
    ( $xMin  $yMin  $zMin )
    ( $xMax  $yMin  $zMin )
    ( $xMax  $yMax  $zMin )
    ( $xMin  $yMax  $zMin )
    ( $xMin  $yMin  $zMax )
    ( $xMax  $yMin  $zMax )
    ( $xMax  $yMax  $zMax )
    ( $xMin  $yMax  $zMax )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($cellsX $cellsY $cellsZ) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xMin
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    xMax
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    yMin
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    yMax
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    zMin
    {
        type patch;
        faces
        (
            (1 0 4 5)
        );
    }
    zMax
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);

// ************************************************************************* //
