heat-sim-H/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // p_rgh
    // {
    //     solver          GAMG;  // Changed from PCG        // preconditioner  DIC;
    //     smoother       GaussSeidel;  // Moved smoother here
    //     tolerance       1e-05;
    //     relTol          0.2;
    //     pRefCell        0;
    //     pRefValue       0;
    // }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol         0.01;
        smoother       GaussSeidel;
        nPreSweeps     0;
        nPostSweeps    1;
        nFinestSweeps  2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    UFinal {
        $U;
        relTol          0;
    }

    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.05;
    }

    TFinal { //TODO ?
        $T;
        relTol          0;
    }



    p_rghFinal {
       solver          PCG;
       preconditioner  DIC;
       tolerance       1e-06;
       relTol          0.01;
   }

   relaxationFactors
   {
       fields
       {
           p_rgh           0.5;  
           T               0.7;
       }
       equations
       {
           U               0.5;
           T               0.5;
       }
   }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
  pRefCell       100;
  pRefValue      0;

  nOuterCorrectors    1;        // Increase if needed
  nCorrectors         2;        // Increase for better pressure-velocity coupling
  nNonOrthogonalCorrectors 1;   // Increase for highly non-orthogonal meshes

  residualControl
  {
        p_rgh
        {
            tolerance   1e-5; //todo maybe adjust
            relTol     0;
        }
        U
        {
            tolerance   1e-4;
            relTol     0;
        }
        T
        {
            tolerance   1e-4;
            relTol     0;
        }
  }


}


// ************************************************************************* //
