heat-sim-H/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "Pad_Geometry.stl"
);

includedAngle       150;
geometricTestOnly   no;

subsetFeatures
{
    nonManifoldEdges    yes;
    openEdges           yes;
}

trimFeatures
{
    minElem         0;
    minLen          0.0;
}

writeObj            yes;
verboseObj          no;

// ************************************************************************* //
